<?php

return [
    'field'          =>  [
        'full-name'     =>  'الاسم بالكامل',
        'username'      =>  'اسم المستخدم',
        'country'       =>  'الدولة',
        'state'         =>  'الولاية/المحافظة',
        'city'          =>  'المدينة',
        'address'       =>  'العنوان',
        'phone'         =>  'رقم الهاتف',
        'email'         =>  'البريد الإلكتروني',
        'password'      =>  'كلمة السر',
        're-password'   =>  'إعادة كلمة السر',
        'new-password'  =>  'كلمة السر الجديدة',
        'cr-password'   =>  'كلمة السر الحالية',
        'updated-at'    =>  'حُدث في',
        'created-at'    =>  'اُنشئ في',
    ],
    'text'          =>  [
        'in-full-name'  =>  'مثال احمد ابراهيم',
        'in-username'   =>  'مثال ahmed_ibrahem',
        'in-address'    =>  'مثال شارع 17ج - احمد علي',
        'in-phone'      =>  'مثال +201012345678',
        'in-email'      =>  'your-mail@server.domain_name',
        'owner'         =>  'المالك',
        'phone'         =>  'الهاتف',
        'user-info'     =>  'معلومات المستخدم',
        'acc-contact'   =>  'جهة اتصال الحساب',
        'change-pass'   =>  'تغيير كلمة السر',
        'hello'         =>  'اهلاً',
        'welcome'       =>  'مرحباً بك في صفحة حسابك الشخصي',
    ],
    'messages'      =>  [
        'error'         =>  [
            'pass-correct'          =>  'كلمة المرور غير صحيحة.',
            'pass-match'            =>  'كلمة المرور غير مطابقة.',
            'pass-update'           =>  'عذرًا، لدينا مشكلة في تحديث كلمة المرور الخاصة بك. حاول مرة اخرى.',
            'user-pass-incorrect'   =>  'اسم المستخدم أو كلمة المرور غير صحيحة.',
            'country-nf'            =>  'لم يتم العثور على دولة بهذا الاسم',
            'state-nf'              =>  'لم يتم العثور على ولاية/محافظة بهذا الاسم',
            'city-nf'               =>  'لم يتم العثور على مدينة بهذا الاسم',
            'register-save'         =>  'عذرًا، لدينا مشكلة في تسجيل حسابك. حاول مرة اخرى.',
            'information-update'    =>  'عذرًا، لدينا مشكلة في تحديث معلوماتك. حاول مرة اخرى.',
            'account-contact-update'=>  'عذرًا، لدينا مشكلة في تحديث جهة اتصال حسابك. حاول مرة اخرى.',
            'address-update'        =>  'عذرًا، لدينا مشكلة في تحديث عنوانك. حاول مرة اخرى.',
        ],
        'success'       =>  [
            'pass-update'           =>  'تم تحديث كلمة المرور بنجاح.',
            'register-save'         =>  'أنت الآن عضو في مجتمعنا الإيجابي.',
            'information-update'    =>  'تم تحديث المعلومات بنجاح.',
            'account-contact-update'=>  'تم تحديث جهة اتصال الحساب بنجاح',
            'address-update'        =>  'تم تحديث العنوان بنجاح.',
        ],
    ],
    'pages'         =>  [
        'profile'       =>  [
            'index'         =>  [
                'titlePage'     => 'الحساب الشخصي',
            ],
        ],
    ],
];